pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxPms_regdef.h
/** \brief EVRC SD Coefficient Register 2 */
typedef struct _Ifx_PMS_EVRSDCOEFF2_Bits
{
    Ifx_UReg_32Bit COEFF1:11;         /**< \brief [10:0] Coefficient 1(condlimx_coeff1x_i) - COEFF1 (rw) */
    Ifx_UReg_32Bit COEFF2:5;          /**< \brief [15:11] Coefficient 2(condlim1_coeff2_i) - COEFF2 (rw) */
    Ifx_UReg_32Bit COEFF3V3:4;        /**< \brief [19:16] 3V3 Line Adaptation Coefficient(lcoeff_coeff3v3_i) - COEFF3V3 (rw) */
    Ifx_UReg_32Bit COEFF5V:4;         /**< \brief [23:20] 5V Line Adaptation Coefficient(lcoeff_coeff5v_i) - COEFF5V (rw) */
    Ifx_UReg_32Bit LINEADAPEN:1;      /**< \brief [24:24] Integrator Adaptation Enable on Line Jump(lineadap_en_i) - LINEADAPEN (rw) */
    Ifx_UReg_32Bit LINEPOSTHR:3;      /**< \brief [27:25] Positive Threshold for VEXT line change(lineadap_posthr_i) - LINEPOSTHR (rw) */
    Ifx_UReg_32Bit LINENEGTHR:3;      /**< \brief [30:28] Negative Threshold for VEXT line change(lineadap_negthr_i) - LINENEGTHR (rw) */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCOEFF2_Bits;

/** \brief EVRC SD Coefficient Register 3 */
typedef struct _Ifx_PMS_EVRSDCOEFF3_Bits
{
    Ifx_UReg_32Bit BYPONTHR:8;        /**< \brief [7:0] Bypass mode On VEXT threshold(bponthr_thr_i) - BYPONTHR (rw) */
    Ifx_UReg_32Bit SDDIGIN0:8;        /**< \brief [15:8] Digital Control(config3_i) - SDDIGIN0 (rw) */
    Ifx_UReg_32Bit SDDIGIN1:5;        /**< \brief [20:16] Digital Control(config4_i) - SDDIGIN1 (rw) */
    Ifx_UReg_32Bit SDDIGIN2:8;        /**< \brief [28:21] Digital Control(config2_i) - SDDIGIN2 (rw) */
    Ifx_UReg_32Bit reserved_29:2;     /**< \brief [30:29] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCOEFF3_Bits;

/** \brief EVRC SD Control Register 0 */
typedef struct _Ifx_PMS_EVRSDCTRL0_Bits
{
    Ifx_UReg_32Bit SDFREQSPRD:4;      /**< \brief [3:0] Frequency Spread Threshold(freq_spread_mode_i) - SDFREQSPRD (rw) */
    Ifx_UReg_32Bit reserved_4:26;     /**< \brief [29:4] \internal Reserved */
    Ifx_UReg_32Bit UP:1;              /**< \brief [30:30] Update request for SMPS register values(param_update_i) - UP (rwh) */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL0_Bits;

/** \brief EVRC SD Control Register 1 */
typedef struct _Ifx_PMS_EVRSDCTRL1_Bits
{
    Ifx_UReg_32Bit TON:8;             /**< \brief [7:0] Charge Phase length(ton_pulse_len_i) - TON (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit TOFF:8;            /**< \brief [23:16] Dicharge Phase length(toff_pulse_len_i) - TOFF (rw) */
    Ifx_UReg_32Bit reserved_24:6;     /**< \brief [29:24] \internal Reserved */
    Ifx_UReg_32Bit SYNCEN:1;          /**< \brief [30:30] EVRC Synchronization input enable(synci0_en_i) (t.b.d.) - SYNCEN (rw) */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL1_Bits;

/** \brief EVRC SD Control Register 10 */
typedef struct _Ifx_PMS_EVRSDCTRL10_Bits
{
    Ifx_UReg_32Bit DTLOCONEN:1;       /**< \brief [0:0] Enable Dead time at low conductance(dtlocon_en_i) - DTLOCONEN (rw) */
    Ifx_UReg_32Bit DTLOCONMIN:6;      /**< \brief [6:1] Minimum Charge + Discharge time after Dead time(dtlocon_mintime_i) - DTLOCONMIN (rw) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit DTOVERREN:1;       /**< \brief [8:8] Enable Dead time on VDD output voltage error(dtov_en_i) - DTOVERREN (rw) */
    Ifx_UReg_32Bit DTOVERRMIN:4;      /**< \brief [12:9] Dead time VDD Output Voltage Error Threshold(dtov_thr_i) - DTOVERRMIN (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit DTOV3V3BASE:5;     /**< \brief [20:16] Dead time 3V3 base value for Output Voltage Error(dtov3v3_base_i) - DTOV3V3BASE (rw) */
    Ifx_UReg_32Bit reserved_21:3;     /**< \brief [23:21] \internal Reserved */
    Ifx_UReg_32Bit DTOV5VBASE:5;      /**< \brief [28:24] Dead time 5V base value for Output Voltage Error(dtov5v_base_i) - DTOV5VBASE (rw) */
    Ifx_UReg_32Bit reserved_29:2;     /**< \brief [30:29] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL10_Bits;

/** \brief EVRC SD Control Register 2 */
typedef struct _Ifx_PMS_EVRSDCTRL2_Bits
{
    Ifx_UReg_32Bit DROOPVH:5;         /**< \brief [4:0] High VDD Limit for Droop request(droopvh_thres_i) - DROOPVH (rw) */
    Ifx_UReg_32Bit reserved_5:3;      /**< \brief [7:5] \internal Reserved */
    Ifx_UReg_32Bit DROOPVL:5;         /**< \brief [12:8] Low VDD Limit for Droop request(droopvl_thres_i) - DROOPVL (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit SYNCMAXDEV:5;      /**< \brief [20:16] Maximum Deviation of the Synchronization Input Frequency(synci1_maxdev_i) - SYNCMAXDEV (rw) */
    Ifx_UReg_32Bit reserved_21:3;     /**< \brief [23:21] \internal Reserved */
    Ifx_UReg_32Bit SYNCHYST:3;        /**< \brief [26:24] Lock Unlock Hysteresis Window(synci0_hyst_i) - SYNCHYST (rw) */
    Ifx_UReg_32Bit reserved_27:1;     /**< \brief [27:27] \internal Reserved */
    Ifx_UReg_32Bit SYNCMUXSEL:2;      /**< \brief [29:28] Synchronisation Input Multiplexer - SYNCMUXSEL (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL2_Bits;

/** \brief EVRC SD Control Register 3 */
typedef struct _Ifx_PMS_EVRSDCTRL3_Bits
{
    Ifx_UReg_32Bit MODSEL:1;          /**< \brief [0:0] Manual or Automatic Mode Selection(bypass_mode_i) - MODSEL (rw) */
    Ifx_UReg_32Bit BYPSEL:5;          /**< \brief [5:1] Bypass Mode Selection(bypass_sel_i) - BYPSEL (rw) */
    Ifx_UReg_32Bit reserved_6:25;     /**< \brief [30:6] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL3_Bits;

/** \brief EVRC SD Control Register 4 */
typedef struct _Ifx_PMS_EVRSDCTRL4_Bits
{
    Ifx_UReg_32Bit SDVOKLVL:6;        /**< \brief [5:0] Voltage OK Circuit Configuration(config1_voltok_i) - SDVOKLVL (rw) */
    Ifx_UReg_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_UReg_32Bit SDLUT:6;           /**< \brief [13:8] Non linearity slope and threshold(config0_lut_i) - SDLUT (rw) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit OLEN:1;            /**< \brief [15:15] Open Loop Operation Enable(open_loop_op_i) - OLEN (rw) */
    Ifx_UReg_32Bit SDOLCON:11;        /**< \brief [26:16] Initial Conductance during Start-up(open_loop_init_i) - SDOLCON (rw) */
    Ifx_UReg_32Bit reserved_27:1;     /**< \brief [27:27] \internal Reserved */
    Ifx_UReg_32Bit ZEROBIN:2;         /**< \brief [29:28] Stabilization strength Zero Error Bin(zero_bin_i) - ZEROBIN (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL4_Bits;

/** \brief EVRC SD Control Register 5 */
typedef struct _Ifx_PMS_EVRSDCTRL5_Bits
{
    Ifx_UReg_32Bit STSPEED3V3:2;      /**< \brief [1:0] 3V3 Integration Start-up coefficient(startup0_speed3v3_i) - STSPEED3V3 (rw) */
    Ifx_UReg_32Bit STDTEN:1;          /**< \brief [2:2] Dead time Enable during start-up(startup0_dten_i) - STDTEN (rw) */
    Ifx_UReg_32Bit STDT:5;            /**< \brief [7:3] Dead time value during start-up(startup0_dt_i) - STDT (rw) */
    Ifx_UReg_32Bit STSPEED5V:2;       /**< \brief [9:8] 5VIntegration Start-up coefficient(startup1_speed5v_i) - STSPEED5V (rw) */
    Ifx_UReg_32Bit STEN16R32R:1;      /**< \brief [10:10] Subswitch selection during start-up(startup1_en16r32r_i) - STEN16R32R (rw) */
    Ifx_UReg_32Bit STTH32ROFF:5;      /**< \brief [15:11] Threshold to turn off 32R sub-switch during start-up(startup1_th32roff_i) - STTH32ROFF (rw) */
    Ifx_UReg_32Bit STCONLIMEN:1;      /**< \brief [16:16] Conductance Limitation Enable(condlim2_en_i) - STCONLIMEN (rw) */
    Ifx_UReg_32Bit STCONLIMINC:2;     /**< \brief [18:17] Start-up Conductance Limit Increment Factor(condlim2_startinc_i) - STCONLIMINC (rw) */
    Ifx_UReg_32Bit STCONDEC:2;        /**< \brief [20:19] Conductance decrementing factor during start-up(startup3_conddec_i) - STCONDEC (rw) */
    Ifx_UReg_32Bit reserved_21:10;    /**< \brief [30:21] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL5_Bits;

/** \brief EVRC SD Control Register 6 */
typedef struct _Ifx_PMS_EVRSDCTRL6_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit SYNCLCKOPT:1;      /**< \brief [16:16] First synchronization option selection(synci0_lockopt_i) - SYNCLCKOPT (rw) */
    Ifx_UReg_32Bit reserved_17:3;     /**< \brief [19:17] \internal Reserved */
    Ifx_UReg_32Bit SYNCSPOINT:4;      /**< \brief [23:20] Synchronization point(synci2_spoint_i) - SYNCSPOINT (rw) */
    Ifx_UReg_32Bit SYNCDIVFAC:3;      /**< \brief [26:24] Switching frequency division factor for external synchronisation(sd_syncdiv_i) - SYNCDIVFAC (rw) */
    Ifx_UReg_32Bit reserved_27:4;     /**< \brief [30:27] \internal Reserved */
    Ifx_UReg_32Bit LCK:1;             /**< \brief [31:31] Lock Status - LCK (rh) */
} Ifx_PMS_EVRSDCTRL6_Bits;

